ETL/Catalogs/СпособыПодбораЭталонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СпособыПодбораЭталонов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураТаблицSQL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭталона</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЭталонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРегламенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Comment>По умолчанию (для данного эталона)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляЗагрузкиДанных</Name>
					<Comment>Использовать для загрузки данных</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитЭталона</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеПредставление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поиск</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПолейSQL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаУстановкиЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЭталона</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыЭталонов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПравил</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РегламентныеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПодбораЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/СпособыПодбораЭталонов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
// Код процедур и функций
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Предопределенный Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораИменПолей(); 
	ЗаполнитьСписокРеквизитовЭталона();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ПоРегламенту И Объект.РегламентныеДействия.Количество() = 0 Тогда
		Сообщить("Не заполнены регламентные действия. Автоподбор эталонов выполняться не будет!");
	КонецЕсли;   
	
	Если Объект.ДляЗагрузкиДанных И СтрНайти(Объект.ТекстЗапроса, "&База") = 0 Тогда
		
		Сообщить("В способе подбора для загрузки данных должен обязательно присутствовать параметр ""База""");
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Отбор = Новый Структура("ИмяПоля", "GUID");
	Если Объект.СтруктураПолей.НайтиСтроки(Отбор).Количество() = 0 Тогда
		Сообщить("В списке полей отсутствует обязательное поле ""GUID""");
		Отказ = Истина;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
&НаКлиенте
Процедура СтруктураПолейПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораИменПолей();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЭталонаПриИзменении(Элемент)
	ЗаполнитьСписокРеквизитовЭталона();
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	
	ЗаполнитьПараметрыИзЗапроса();
	
КонецПроцедуры
 
#КонецОбласти


#Область ОбработчикиКомандФормы
// Код процедур и функций

&НаКлиенте
Процедура ПолучитьБазовыйЗапрос(Команда)
	ПолучитьБазовыйЗапросНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтандартныеУсловия(Команда)
	// Вставить содержимое обработчика.  
	
	Если СтрНайти(ВРЕГ(Объект.ТекстЗапроса), "WHERE") = 0 Тогда
		Объект.ТекстЗапроса = Объект.ТекстЗапроса + Символы.ПС + 
		"WHERE Data.Base = &База AND Data.id > 0";
	Иначе
		 Объект.ТекстЗапроса = Объект.ТекстЗапроса + Символы.ПС + 
		"AND Data.Base = &База AND Data.id > 0";
	КонецЕсли;		

КонецПроцедуры


&НаКлиенте
Процедура ПолучитьПараметрыИзЗапроса(Команда)
	
	ЗаполнитьПараметрыИзЗапроса();	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций

&НаСервере
Процедура ЗаполнитьСписокВыбораИменПолей()
	
    СписокВыбора = Объект.СтруктураПолей.Выгрузить(,"ИмяПоля").ВыгрузитьКолонку("ИмяПоля");
	Элементы.ЭталоныПоУмолчаниюИмяПоля.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
    
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокРеквизитовЭталона()
	
	Если ЗначениеЗаполнено(Объект.ТипЭталона) Тогда
		СписокРеквизитов = Объект.ТипЭталона.Реквизиты.ВыгрузитьКолонку("Реквизит");
		Элементы.СтруктураПолейРеквизитЭталона.СписокВыбора.ЗагрузитьЗначения(СписокРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоРегламентуПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ПоРегламенту Тогда
		Элементы.ГруппаРегламентныеДействия.Видимость = Истина; 
	Иначе
		Элементы.ГруппаРегламентныеДействия.Видимость = Ложь; 		
	КонецЕсли;		
		
КонецПроцедуры

 &НаКлиенте
Процедура РегламентныеДействияДействиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.РегламентныеДействия.НайтиСтроки(Новый Структура("Действие", ВыбранноеЗначение)).Количество() <> 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

 &НаСервере
Процедура ПолучитьБазовыйЗапросНаСервере()
	
	ПоляЗапроса = Новый Массив;
	Объект.ТекстЗапроса = РаботаСЭталонамиСервер.ЗапросКДаннымИсточника(Объект.ТаблицаИсточникДанных, ПоляЗапроса);	
	Объект.СтруктураПолей.Очистить();
	
	Для каждого Поле из ПоляЗапроса Цикл
		
		НовоеПоле = Объект.СтруктураПолей.Добавить();
		НовоеПоле.ИмяПоля = Поле;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыИзЗапроса()
	
	Запрос = Объект.ТекстЗапроса;
	МассивПараметров = Новый Массив;
	
	Поз = СтрНайти(Запрос, "&");
	Пока  Поз <> 0 Цикл
		
		Параметр = "";
		Запрос = Прав(Запрос, СтрДлина(Запрос) - Поз);
		Пока Лев(Запрос, 1) <> " " И Лев(Запрос, 1) <> Символы.ПС 
			И Лев(Запрос, 1) <> ")" И СтрДлина(Запрос) <> 0 Цикл
			Параметр = Параметр + Лев(Запрос, 1);
			Запрос = Прав(Запрос, СтрДлина(Запрос) - 1);
		КонецЦикла;
		Если Параметр <> "" Тогда
			МассивПараметров.Добавить(Параметр);
		КонецЕсли;
		Поз = СтрНайти(Запрос, "&");
	КонецЦикла;   
	
	Для каждого Параметр из МассивПараметров Цикл
		Отбор = Новый Структура("ИмяПараметра", Параметр);
		Если Объект.Параметры.НайтиСтроки(Отбор).Количество() = 0 Тогда
			НоваяСтрока = Объект.Параметры.Добавить();
			НоваяСтрока.ИмяПараметра = Параметр;
			НоваяСтрока.Представление = Параметр;		  
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти
